IDENTIFICATION DIVISION.
PROGRAM-ID. ASSIGNMENT.
DATA DIVISION.
WORKING-STORAGE SECTION.
    05 A PIC 9(2).
PROCEDURE DIVISION.
    MOVE 1 TO A
    DISPLAY A
    STOP RUN.
