IDENTIFICATION DIVISION.
PROGRAM-ID. ASSIGNMENT.
DATA DIVISION.
WORKING-STORAGE SECTION.
    05 A PIC 9(2).
    05 B PIC 9(2).
    05 C PIC X(10).
PROCEDURE DIVISION.
    MOVE 1 TO A
    MOVE 2 TO B
    MOVE "Hello, World!" TO C
    DISPLAY A
    DISPLAY B
    DISPLAY C
    STOP RUN.
