IDENTIFICATION DIVISION.
PROGRAM-ID. array.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01  WS-ARRAY.
        05  WS-ARRAY-ROW PIC S9(4) OCCURS 4.
    05 WS-ARRAY-INDEX PIC 9(3) VALUE 1.

PROCEDURE DIVISION.
    MOVE 5 TO WS-ARRAY-ROW(1)
    MOVE 10 TO WS-ARRAY-ROW(2)
    MOVE 43 TO WS-ARRAY-ROW(3)
    MOVE 101 TO WS-ARRAY-ROW(4)
    DISPLAY "The first element is: " WS-ARRAY-ROW(1)
    DISPLAY "The second element is: " WS-ARRAY-ROW(2)
    DISPLAY "The third element is: " WS-ARRAY-ROW(3)
    DISPLAY "The fourth element is: " WS-ARRAY-ROW(4)
    STOP RUN.
