IDENTIFICATION DIVISION.
PROGRAM-ID. variables.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01  WS-SORT-AREA.
    05  WS-SORT-TABLE.
       10  WS-SORT-ROW PIC X(10) OCCURS 100.
    05  WS-TEMP-ROW     PIC X(10).
    05  WS-ROW-MAX      PIC S9(4) COMP VALUE 100.
    05  WS-SORT-MAX     PIC S9(4) COMP.
    05  WS-I            PIC S9(4) COMP.
    05  WS-J            PIC S9(4) COMP.
    05  WS-INDEX        PIC S9(4) COMP.
    77 a PIC S9(5)V9(5) COMP-3 VALUE 1.
    77 b PIC S9(5)V9(5) COMP-3 VALUE 5.
    77 c PIC S9(5)V9(5) COMP-3 VALUE 6.
    77 discriminant PIC S9(5)V9(5) COMP-3.
    77 root1 PIC S9(5)V9(5) COMP-3.
    77 root2 PIC S9(5)V9(5) COMP-3.
    77 square-root-discriminant PIC S9(5)V9(5) COMP-3.

PROCEDURE DIVISION.
    DISPLAY 'Hello World!'
    STOP RUN.